## Staging: load_balancer
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
inputs.tf
```
```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.saas_procurement`                                                |
|        | `aws_acm_certificate_validation.saas_procurement`                                     |
|        | `aws_lb.saas_procurement`                                                             |
|        | `aws_lb_listener.saas_procurement_listener`                                           |
|        | `aws_lb_target_group.saas_procurement`                                                |
|        | `aws_route53_record.saas_procurement_certificate_validation[&quot;*.saas.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.saas_procurement_certificate_validation[&quot;saas.cdssandbox.xyz&quot;]`   |
|        | `aws_security_group.saas_procurement_load_balancer`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.saas_procurement will be created
  + resource "aws_acm_certificate" "saas_procurement" {
      + arn                       = (known after apply)
      + domain_name               = "saas.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.saas.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "saas.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.saas.cdssandbox.xyz",
          + "saas.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                  = {
          + "CostCentre" = "saas-procurement"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = (known after apply)
        }
    }

  # aws_acm_certificate_validation.saas_procurement will be created
  + resource "aws_acm_certificate_validation" "saas_procurement" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb.saas_procurement will be created
  + resource "aws_lb" "saas_procurement" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "saas-procurement-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + jsonencode(
                [
                  + "subnet-01a482ab028dbb38a",
                  + "subnet-0d76fea2786c5d960",
                  + "subnet-0458b13f2b680703f",
                ]
            ),
        ]
      + tags                                        = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                                    = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.saas_procurement_listener will be created
  + resource "aws_lb_listener" "saas_procurement_listener" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.saas_procurement will be created
  + resource "aws_lb_target_group" "saas_procurement" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saas-procurement"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                           = {
          + "CostCentre" = "saas-procurement"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-04ac29c4ad6b4676e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_route53_record.saas_procurement_certificate_validation["*.saas.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "saas_procurement_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00932713D2LTPGCGM793"
    }

  # aws_route53_record.saas_procurement_certificate_validation["saas.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "saas_procurement_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00932713D2LTPGCGM793"
    }

  # aws_security_group.saas_procurement_load_balancer will be created
  + resource "aws_security_group" "saas_procurement_load_balancer" {
      + arn                    = (known after apply)
      + description            = "Ingress - Saas Procurement Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "Saas Procurement load balancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all               = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                 = "vpc-04ac29c4ad6b4676e"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.saas_procurement_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.saas_procurement_load_balancer"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
